#include <stdio.h>
#include <curses.h>
#include "matrix.h"
#include "structure.h"

/*void help()
{
	initscr();
	move(10,20);
	printw("%s","hello");
	refresh();
	sleep(2);
	endwin();
}
*/

void matrix_calculator()
{
	do
	{
		main_menu();
		int choice;
		scanf("%d",&choice);
		switch(choice)
		{
			case 1:
			 {
				add_matrix();
				break;
			 }
			case 2:
			 {
				change();
				break;
			 }
			case 3:
			 {
				 calculate();
				 break;
			 }
			case 4:
			 {
				 Help();
				 break;
			 }
			case 5:
			 {
				 ByBy();
				 return;
			 }
			default:
			 {
				 printf("您的输入有误!!!\n");
				 printf("请再次数入.\n");
				 printf("\n");
				 break;
			 }
		}
	}while(1);
}

void main_menu()
{
//	printf("\033[0;44m                                                                             \033[0m\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\033[1;34m*********************************************************************************\n");
	printf("*********************************************************************************\n");
	printf("*********************************************************************************\n");
	printf("*******                                                                   *******\n");
	printf("*******                                                                   *******\n");
	printf("*******");
	printf("            \033[1;31m             欢迎进入矩阵运算器！ \033[0m");
	printf("                     \033[1;34m*******\n");
	printf("*******                                                                   *******\n");
	printf("*******                                                                   *******\n");
	printf("*********************************************************************************\n");
	printf("*********************************************************************************\n");
	printf("*********************************************************************************\033[0m\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	sleep(1);

	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\033[0;42m                                                                                 \033[0m\n");
	printf("*********************************************************************************\n");
	printf("*                                                                               *\n");
	printf("*                                  \033[1;31m  主菜单 \033[0m                                    *\n");
	printf("*                                                                               *\n");
	printf("*********************************************************************************\n");
	printf("*                 请 选 择 您 要 进 行 的 操 作(输入操作前的编号):              *\n");
	printf("*                              1.输入或导入矩阵                                 *\n");
	printf("*                              2.修改矩阵信息                                   *\n");
	printf("*                              3.进行矩阵运算                                   *\n");
	printf("*                              4.用户帮助                                       *\n");
	printf("*                              5.退出矩阵计算器                                 *\n");
	printf("*********************************************************************************\n");
	printf("\n\n\n\n\n\n\n\n\n");
	printf("您的选择是: ");
}

void ByBy()
{
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\033[1;34m*********************************************************************************\n");
	printf("*********************************************************************************\n");
	printf("*********************************************************************************\n");
	printf("******                                                                    *******\n");
	printf("******                             ");
	printf("\033[1;31m 再见！");
	printf("\033[1;34m                                *******\n");
	printf("******                                                                    *******\n");
	printf("*********************************************************************************\n");
	printf("*********************************************************************************\n");
	printf("*********************************************************************************\033[0m\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	sleep(1);
	printf("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n");
}
